In [1]:
1

1

In [2]:
1+1

2

In [3]:
30*5

150

In [4]:
(150*10)*15-13

22487

In [5]:
x=1

In [6]:
x+2

3

In [11]:
x=x+2
x
x=x+2
x

9

In [10]:
x

5

In [17]:
def sumados(n):
    n=n+2
    print(n)

In [71]:
sumados(10)

12

In [47]:
def hola1(n):
    print("hola ",n," como estas?")

In [48]:
hola1("karla")

hola  karla  como estas?

In [54]:
def hola3(n):
    print("hola",n,"mundo")

In [55]:
hola3("")

hola  mundo

In [73]:

cadena="somos data tres".capitalize()
print(cadena)
cadena.count("s")

Somos data tres

2

In [82]:

cadena="hipopotamo".capitalize()
print(cadena)
cadena.count("o")

Hipopotamo

3

In [79]:
cadena.count("p")

2

In [80]:
cadena.count("i")

1

In [86]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df.head()

,ID,TiempodeAtencion,TipoAtencion,TipoAtencion.1,Monto,Tasa,Plazo,Tipodesembolso,NPS,TipoNPS
0,251653,19,1,Caja,4262,29,36,efectivo,9,NPS_alto
1,251610,20,1,Caja,3320,30,46,Cuenta,10,NPS_alto
2,251314,18,1,Caja,4303,19,15,efectivo,10,NPS_alto
3,251313,55,1,Caja,4398,19,13,efectivo,5,NPS_bajo
4,251294,20,2,Plataforma,4963,28,31,Cuenta,10,NPS_alto

In [88]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df.describe(include='all')

,ID,TiempodeAtencion,TipoAtencion,TipoAtencion.1,Monto,Tasa,Plazo,Tipodesembolso,NPS,TipoNPS
count,125.000000,125.000000,125.000000,125,125.000000,125.000000,125.000000,125,125.000000,125
unique,NaN,NaN,NaN,2,NaN,NaN,NaN,2,NaN,3
top,NaN,NaN,NaN,Caja,NaN,NaN,NaN,Cuenta,NaN,NPS_Medio
freq,NaN,NaN,NaN,66,NaN,NaN,NaN,70,NaN,62
mean,246707.712000,27.640000,1.472000,NaN,3091.080000,23.512000,29.440000,NaN,7.472000,NaN
std,1586.729782,15.790667,0.501224,NaN,1142.356567,7.150024,10.650912,NaN,1.711328,NaN
min,245851.000000,10.000000,1.000000,NaN,1021.000000,12.000000,12.000000,NaN,5.000000,NaN
25%,245971.000000,15.000000,1.000000,NaN,2180.000000,17.000000,19.000000,NaN,6.000000,NaN
50%,246077.000000,20.000000,1.000000,NaN,3029.000000,23.000000,30.000000,NaN,7.000000,NaN
75%,246218.000000,40.000000,2.000000,NaN,4209.000000,30.000000,38.000000,NaN,9.000000,NaN
max,251653.000000,60.000000,2.000000,NaN,4989.000000,36.000000,48.000000,NaN,10.000000,NaN

In [103]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df[['Tasa', 'Plazo']]

     Tasa  Plazo
0      29     36
1      30     46
2      19     15
3      19     13
4      28     31
..    ...    ...
120    21     13
121    22     27
122    30     28
123    28     33
124    36     16

[125 rows x 2 columns]

In [104]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df[['Tasa', 'Plazo', 'ID']]

     Tasa  Plazo      ID
0      29     36  251653
1      30     46  251610
2      19     15  251314
3      19     13  251313
4      28     31  251294
..    ...    ...     ...
120    21     13  246245
121    22     27  246248
122    30     28  246252
123    28     33  246256
124    36     16  246261

[125 rows x 3 columns]

In [113]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df2 = df[['Tasa', 'Plazo']]
df2.describe(include = 'all')

             Tasa       Plazo
count  125.000000  125.000000
mean    23.512000   29.440000
std      7.150024   10.650912
min     12.000000   12.000000
25%     17.000000   19.000000
50%     23.000000   30.000000
75%     30.000000   38.000000
max     36.000000   48.000000

In [114]:
import pandas as dp
df=dp.read_csv('DataPrueba (1).csv')
df3=df[['ID']]
df3.describe(include='all')

                  ID
count     125.000000
mean   246707.712000
std      1586.729782
min    245851.000000
25%    245971.000000
50%    246077.000000
75%    246218.000000
max    251653.000000